Documents/Штраф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Штраф</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратПродукции</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТовараПоставщику</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Замена</xr:Item>
				<xr:Item>Document.Лид</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыработкаИсполнителейРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаИсполнителейПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрафы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДокументу</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
								<v8:Type>cfg:DocumentRef.Лид</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВыработкаИсполнителейРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаИсполнителейРозницы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументУСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаСтоимостиВыработкиПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВыработки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаИсполнителейПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаИсполнителейПроизводства</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСтоимостиВыработкиПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизводственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВыработки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/НаправленияДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправленияДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Штраф/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		Для Каждого ТекСтрокаОтветственные Из ДанныеЗаполнения.Ответственные Цикл
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаОтветственные.Сотрудник;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараПоставщику") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник; 
	//nva+++
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;
		НоваяСтрока.ВидНачисления = Справочники.ВидыНачислений.Штраф;
		НоваяСтрока.КДокументу = Основание;
	//nva---	
	//Начало исключен при переходе на 2.0
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
	//	Организация = ДанныеЗаполнения.Организация;
	//	Подразделение = ДанныеЗаполнения.Подразделение;
	//	Основание = ДанныеЗаполнения.Ссылка;
	//	НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
	//Конец исключен при переходе на 2.0

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Производство;
		Для Каждого ТекСтрокаИсполнители Из ДанныеЗаполнения.Исполнители Цикл
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаИсполнители.Сотрудник;
		КонецЦикла;	
		Для Каждого ТекСтрока Из ДанныеЗаполнения.ИсполнителиПоОперациям Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник1) Тогда
				НоваяСтрока = Штрафы.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник1;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник2) Тогда
				НоваяСтрока = Штрафы.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник2;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник3) Тогда
				НоваяСтрока = Штрафы.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник3;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.Сотрудник4) Тогда
				НоваяСтрока = Штрафы.Добавить();
				НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник4;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;	
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.ИсполнительЗамера;		
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Менеджер;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Организация = ДанныеЗаполнения.Основание.Организация;
			Подразделение = ДанныеЗаполнения.Основание.Подразделение;	
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Основание.ИсполнительЗамера;		
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Основание.Менеджер;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лид") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		НоваяСтрока = Штрафы.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения.Автор.Сотрудник;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризация") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Неопределено;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		Документы.Монтаж.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения, Тип("ДокументСсылка.Штраф"));		
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Основание = ДанныеЗаполнения.Ссылка;
		НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Бригадир) Тогда
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ДанныеЗаполнения.Бригадир;
		КонецЕсли;
		Для Каждого ТекСтрокаИсполнители Из ДанныеЗаполнения.Исполнители Цикл
			НоваяСтрока = Штрафы.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаИсполнители.Сотрудник;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Для Каждого ТекущаяСтрока Из Штрафы Цикл
			ТекущаяСтрока.Валюта = ВалютаУчета;
			ТекущаяСтрока.ВидНачисления = Справочники.ВидыНачислений.Штраф;
			ТекущаяСтрока.КДокументу = Основание;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если НаправлениеДеятельности = Перечисления.НаправленияДеятельности.Розница Тогда
		// регистр ВыработкаИсполнителейРозницы 
		Движения.ВыработкаИсполнителейРозницы.Записывать = Истина;
		Для Каждого ТекСтрокаШтрафы Из Штрафы Цикл
			Движение = Движения.ВыработкаИсполнителейРозницы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаШтрафы.Сотрудник;
			Движение.ВидНачисления = ТекСтрокаШтрафы.ВидНачисления;
			Движение.Количество = 1;
			Движение.Стоимость = -РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаШтрафы.Валюта, ВалютаУчета, Дата, ТекСтрокаШтрафы.Сумма); // №10724 пересчёт в валюту учёта
			Если ТекСтрокаШтрафы.КДокументу <> Неопределено И НЕ ТекСтрокаШтрафы.КДокументу.Пустая() Тогда
				Движение.ОбъектВыработки = ТекСтрокаШтрафы.КДокументу;
			Иначе
				Движение.ОбъектВыработки = Ссылка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// регистр ВыработкаИсполнителейПроизводства 
		Движения.ВыработкаИсполнителейПроизводства.Записывать = Истина;
		Для Каждого ТекСтрокаШтрафы Из Штрафы Цикл
			Движение = Движения.ВыработкаИсполнителейПроизводства.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = Подразделение;
			Движение.Сотрудник = ТекСтрокаШтрафы.Сотрудник;
			Движение.ВидНачисления = ТекСтрокаШтрафы.ВидНачисления;
			Движение.Количество = 1;
			Движение.Стоимость = -РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаШтрафы.Валюта, ВалютаУчета, Дата, ТекСтрокаШтрафы.Сумма); // №10724 пересчёт в валюту учёта
			Движение.Цена = Движение.Стоимость;
			Если ТекСтрокаШтрафы.КДокументу <> Неопределено И НЕ ТекСтрокаШтрафы.КДокументу.Пустая() Тогда
				Движение.ОбъектВыработки = ТекСтрокаШтрафы.КДокументу;
			Иначе
				Движение.ОбъектВыработки = Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
